pehill-cases-OpenFOAM/case_0p8/0/TauDNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(6.731744424619633043e-07 8.320325029748173071e-09 0.000000000000000000e+00 7.445348646306364275e-10 0.000000000000000000e+00 2.369963523137308060e-07)
(6.734675791948272267e-07 8.455296231951398380e-09 0.000000000000000000e+00 7.594935725767594366e-10 0.000000000000000000e+00 2.402318289985214959e-07)
(6.738504083690176458e-07 8.592717235888215650e-09 0.000000000000000000e+00 7.751580935602582624e-10 0.000000000000000000e+00 2.434132265865642641e-07)
(6.741441818286521200e-07 8.730113391182235650e-09 0.000000000000000000e+00 7.934203651071005630e-10 0.000000000000000000e+00 2.464958623143107539e-07)
(6.747740868165122313e-07 8.858535091254142441e-09 0.000000000000000000e+00 8.134036032344165193e-10 0.000000000000000000e+00 2.495657533246248776e-07)
(6.760484064328962089e-07 9.011865536143615544e-09 0.000000000000000000e+00 8.380385959724674218e-10 0.000000000000000000e+00 2.529181458047599799e-07)
(6.772386060000519010e-07 9.158188382694955275e-09 0.000000000000000000e+00 8.644233432640936664e-10 0.000000000000000000e+00 2.563689369218904009e-07)
(6.784099761700479161e-07 9.289531120267237137e-09 0.000000000000000000e+00 8.895631730476669728e-10 0.000000000000000000e+00 2.598663845010529919e-07)
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            zeroGradient;
    }
}