pehill-cases-OpenFOAM/case_0p8/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }
    //p
    //{
    //    solver          GAMG;
    //    tolerance       1e-7;
    //    relTol          0.001;
    //    minIter         5;
    //    maxIter         100;
    //    smoother        GaussSeidel;
    //    nPreSweeps      1;
    //    nPostSweeps     3;
    //    nFineSweeps     3;
    //    scaleCorrection true;
    //    directSolverCoarsest    false;
    //    cacheAgglomeration      on;
    //    nCellsInCoarsestLevel    50;
    //    agglomerator    faceAreaPair;
    //    mergeLevels     1;
    //}

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0;
    }
    //pFinal
    //{
    //    solver          GAMG;
    //    tolerance       1e-7;
    //    relTol          0;
    //    minIter         5;
    //    maxIter         100;
    //    smoother        GaussSeidel;
    //    nPreSweeps      1;
    //    nPostSweeps     3;
    //    nFineSweeps     3;
    //    scaleCorrection true;
    //    directSolverCoarsest    false;
    //    cacheAgglomeration      on;
    //    nCellsInCoarsestLevel    50;
    //    agglomerator    faceAreaPair;
    //    mergeLevels     1;
    //}

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
       tolerance       1e-09;
       relTol          0;
    }
    //U
    //{
    //    solver      smoothSolver;
    //    smoother    GaussSeidel;
    //    tolerance   1e-6;
    //    relTol      0.01;
    //    nSweeps     1;
    //    maxIter     100;
    //}

    k
    {
        solver          PBiCG;
        preconditioner  DILU;
       tolerance       1e-09;
       relTol          0;
    }


    epsilon
    {
        solver          PBiCG;
        preconditioner  DILU;
       tolerance       1e-10;
       relTol          0;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    convergence     1e-8;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p       0.3;
    U       0.7;
    k       0.7;
    epsilon 0.7;
    R       0.7;
    nuTilda 0.7;

}

// ************************************************************************* //
